/*Задание 6.
Дан массив.
Проверить, одинаковые ли элементы в массиве и вывести результат true или false в консоль.
Речь идёт не о двух рядом стоящих одинаковых элементах, а обо всех.
Проверить, все ли элементы в массиве одинаковые.*/

let array = [1,1,1,1,2];
let result = true;

for (let i = 0; i < array.length; i++)
{
    if (array[0] !== array [i])
        result = false;
}
console.log(result);

// Почти верно, но сравнение элементов массива должно быть строгим (=== вместо ==). Иначе элементы "1" и 1 будут считаться одинаковыми, что не соответствует действительности. Выше исправила